# YOLONN structure

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  #   2.9M parameters,     7.5 GFLOPs
  s: [0.33, 0.50, 1024]  #  11.7M parameters,    28.9 GFLOPs
  m: [0.33, 0.75, 1024]   #  25.1M parameters,   64.7 GFLOPs
  l: [0.33, 1.00, 1024]   #  44.6M parameters,   114.9 GFLOPs


backbone:
  # [from, repeats, module, args]
    [
      [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
      [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
      [-1, 3, C2ELAN, [128, True]],
      [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
      [-1, 6, C2ELAN, [256, True]],
      [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
      [-1, 6, C2ELAN, [512, True]],
      [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
      [-1, 3, C2ELAN, [1024, True]],
      [-1, 1, SPPF, [1024, 5]],  # 9

    ]


head:
  [
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 10
    [[-1, 6], 1, Concat, [1]],  # cat backbone 6
    [-1, 3, LightC2ELAN, [512, False]],  # 12

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],  # cat backbone 4


    # small
    [-1, 3, LightC2ELAN, [256, False]],  # 15

    # medium
    [[-1, 4], 1, Concat, [1]], # cat backbone 4
    [-1, 1, CBLinear, [[512], 1, 2]],
    [[-1, 12], 1, ReConvFuse, [[0]]], # Fuse backbone 12
    [-1, 3, LightC2ELAN, [512, False]], # 19

    # large
    [[-1, 6], 1, Concat, [1]], # cat backbone 6
    [-1, 1, CBLinear, [[1024], 1, 2]],
    [[-1, 9], 1, ReConvFuse, [[0]]], # Fuse backbone 9
    [-1, 3, LightC2ELAN, [1024, False]], # 23

    [[ 15, 19, 23], 1, NNDetect, [nc]],  # NNDetect(15 19, 23)
  ]

